nxp-mcuxpresso/mcux-sdk/devices/MKV56F24/MKV56F24.h
#define HSADC_SDIS_DS_MASK                       (0xFFFFU)
#define HSADC_SDIS_DS_SHIFT                      (0U)
/*! DS - Disable Sample Bits
 *  0b0000000000000000..SAMPLEx channel is enabled for HSADC scan.
 *  0b0000000000000001..SAMPLEx channel is disabled for HSADC scan and corresponding channels after SAMPLEx will also not occur in an HSADC scan.
 */
#define HSADC_SDIS_DS(x)                         (((uint16_t)(((uint16_t)(x)) << HSADC_SDIS_DS_SHIFT)) & HSADC_SDIS_DS_MASK)
/*! @} */

/*! @name STAT - HSADC Status Register */
/*! @{ */

#define HSADC_STAT_CALONA_MASK                   (0x1U)
#define HSADC_STAT_CALONA_SHIFT                  (0U)
/*! CALONA - HSADCA Calibration execution status
 *  0b0..Calibration is not running
 *  0b1..ADCA is running calibration conversions
 */
#define HSADC_STAT_CALONA(x)                     (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_CALONA_SHIFT)) & HSADC_STAT_CALONA_MASK)

#define HSADC_STAT_CALONB_MASK                   (0x2U)
#define HSADC_STAT_CALONB_SHIFT                  (1U)
/*! CALONB - HSADCB Calibration execution status
 *  0b0..Calibration is not running
 *  0b1..ADCB is running calibration conversions
 */
#define HSADC_STAT_CALONB(x)                     (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_CALONB_SHIFT)) & HSADC_STAT_CALONB_MASK)

#define HSADC_STAT_DUMMYA_MASK                   (0x4U)
#define HSADC_STAT_DUMMYA_SHIFT                  (2U)
/*! DUMMYA - Dummy conversion running on HSADCA
 *  0b0..Dummy conversion is not running
 *  0b1..Dummy conversion is running on ADCA
 */
#define HSADC_STAT_DUMMYA(x)                     (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_DUMMYA_SHIFT)) & HSADC_STAT_DUMMYA_MASK)

#define HSADC_STAT_DUMMYB_MASK                   (0x8U)
#define HSADC_STAT_DUMMYB_SHIFT                  (3U)
/*! DUMMYB - Dummy conversion running on HSADCB
 *  0b0..Dummy conversion is not running
 *  0b1..Dummy conversion is running on ADCB
 */
#define HSADC_STAT_DUMMYB(x)                     (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_DUMMYB_SHIFT)) & HSADC_STAT_DUMMYB_MASK)

#define HSADC_STAT_EOCALIA_MASK                  (0x10U)
#define HSADC_STAT_EOCALIA_SHIFT                 (4U)
/*! EOCALIA - End of Calibration on ADCA Interrupt
 *  0b0..Calibration is not finished.
 *  0b1..Calibration is finished on ADCA. The IRQ occurs if CALIB[EOCALIEA] is asserted.
 */
#define HSADC_STAT_EOCALIA(x)                    (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_EOCALIA_SHIFT)) & HSADC_STAT_EOCALIA_MASK)

#define HSADC_STAT_EOCALIB_MASK                  (0x20U)
#define HSADC_STAT_EOCALIB_SHIFT                 (5U)
/*! EOCALIB - End of Calibration on ADCB Interrupt
 *  0b0..Calibration is not finished.
 *  0b1..Calibration is finished on ADCB. The IRQ occurs if CALIB[EOCALIEB] is asserted.
 */
#define HSADC_STAT_EOCALIB(x)                    (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_EOCALIB_SHIFT)) & HSADC_STAT_EOCALIB_MASK)

#define HSADC_STAT_HLMTI_MASK                    (0x100U)
#define HSADC_STAT_HLMTI_SHIFT                   (8U)
/*! HLMTI - High Limit Interrupt
 *  0b0..No high limit interrupt request
 *  0b1..High limit exceeded, IRQ pending if CTRL1[HLMTIE] is set
 */
#define HSADC_STAT_HLMTI(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_HLMTI_SHIFT)) & HSADC_STAT_HLMTI_MASK)

#define HSADC_STAT_LLMTI_MASK                    (0x200U)
#define HSADC_STAT_LLMTI_SHIFT                   (9U)
/*! LLMTI - Low Limit Interrupt
 *  0b0..No low limit interrupt request
 *  0b1..Low limit exceeded, IRQ pending if CTRL1[LLMTIE] is set
 */
#define HSADC_STAT_LLMTI(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_LLMTI_SHIFT)) & HSADC_STAT_LLMTI_MASK)

#define HSADC_STAT_ZCI_MASK                      (0x400U)
#define HSADC_STAT_ZCI_SHIFT                     (10U)
/*! ZCI - Zero Crossing Interrupt
 *  0b0..No zero crossing interrupt request
 *  0b1..Zero crossing encountered, IRQ pending if CTRL1[ZCIE] is set
 */
#define HSADC_STAT_ZCI(x)                        (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_ZCI_SHIFT)) & HSADC_STAT_ZCI_MASK)

#define HSADC_STAT_EOSIA_MASK                    (0x800U)
#define HSADC_STAT_EOSIA_SHIFT                   (11U)
/*! EOSIA - End of Scan Interrupt
 *  0b0..A scan cycle has not been completed, no end of scan IRQ pending
 *  0b1..A scan cycle has been completed, end of scan IRQ pending
 */
#define HSADC_STAT_EOSIA(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_EOSIA_SHIFT)) & HSADC_STAT_EOSIA_MASK)

#define HSADC_STAT_EOSIB_MASK                    (0x1000U)
#define HSADC_STAT_EOSIB_SHIFT                   (12U)
/*! EOSIB - End of Scan Interrupt
 *  0b0..A scan cycle has not been completed, no end of scan IRQ pending
 *  0b1..A scan cycle has been completed, end of scan IRQ pending
 */
#define HSADC_STAT_EOSIB(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_EOSIB_SHIFT)) & HSADC_STAT_EOSIB_MASK)

#define HSADC_STAT_CIPB_MASK                     (0x4000U)
#define HSADC_STAT_CIPB_SHIFT                    (14U)
/*! CIPB - Conversion in Progress
 *  0b0..Idle state
 *  0b1..A scan cycle is in progress. The HSADC will ignore all sync pulses or start commands
 */
#define HSADC_STAT_CIPB(x)                       (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_CIPB_SHIFT)) & HSADC_STAT_CIPB_MASK)

#define HSADC_STAT_CIPA_MASK                     (0x8000U)
#define HSADC_STAT_CIPA_SHIFT                    (15U)
/*! CIPA - Conversion in Progress
 *  0b0..Idle state
 *  0b1..A scan cycle is in progress. The HSADC will ignore all sync pulses or start commands
 */
#define HSADC_STAT_CIPA(x)                       (((uint16_t)(((uint16_t)(x)) << HSADC_STAT_CIPA_SHIFT)) & HSADC_STAT_CIPA_MASK)
/*! @} */

/*! @name RDY - HSADC Ready Register */
/*! @{ */

#define HSADC_RDY_RDY_MASK                       (0xFFFFU)
#define HSADC_RDY_RDY_SHIFT                      (0U)
/*! RDY - Ready Sample
 *  0b0000000000000000..Sample not ready or has been read
 *  0b0000000000000001..Sample ready to be read
 */
#define HSADC_RDY_RDY(x)                         (((uint16_t)(((uint16_t)(x)) << HSADC_RDY_RDY_SHIFT)) & HSADC_RDY_RDY_MASK)
/*! @} */

