nxp-mcuxpresso/mcux-sdk/devices/MKV56F24/MKV56F24.h
/*! @name LOLIMSTAT - HSADC Low Limit Status Register */
/*! @{ */

#define HSADC_LOLIMSTAT_LLS_MASK                 (0xFFFFU)
#define HSADC_LOLIMSTAT_LLS_SHIFT                (0U)
/*! LLS - Low Limit Status Bits
 */
#define HSADC_LOLIMSTAT_LLS(x)                   (((uint16_t)(((uint16_t)(x)) << HSADC_LOLIMSTAT_LLS_SHIFT)) & HSADC_LOLIMSTAT_LLS_MASK)
/*! @} */

/*! @name HILIMSTAT - HSADC High Limit Status Register */
/*! @{ */

#define HSADC_HILIMSTAT_HLS_MASK                 (0xFFFFU)
#define HSADC_HILIMSTAT_HLS_SHIFT                (0U)
/*! HLS - High Limit Status Bits
 */
#define HSADC_HILIMSTAT_HLS(x)                   (((uint16_t)(((uint16_t)(x)) << HSADC_HILIMSTAT_HLS_SHIFT)) & HSADC_HILIMSTAT_HLS_MASK)
/*! @} */

/*! @name ZXSTAT - HSADC Zero Crossing Status Register */
/*! @{ */

#define HSADC_ZXSTAT_ZCS_MASK                    (0xFFFFU)
#define HSADC_ZXSTAT_ZCS_SHIFT                   (0U)
/*! ZCS - Zero Crossing Status
 *  0b0000000000000000..Either: A sign change did not occur in a comparison between the current channelx result
 *                      and the previous channelx result, or Zero crossing control is disabled for channelx in the
 *                      zero crossing control register, ZXCTRL
 *  0b0000000000000001..In a comparison between the current channelx result and the previous channelx result, a
 *                      sign change condition occurred as defined in the zero crossing control register (ZXCTRL)
 */
#define HSADC_ZXSTAT_ZCS(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_ZXSTAT_ZCS_SHIFT)) & HSADC_ZXSTAT_ZCS_MASK)
/*! @} */

/*! @name RSLT - HSADC Result Registers with sign extension */
/*! @{ */

#define HSADC_RSLT_RSLT_MASK                     (0x7FF8U)
#define HSADC_RSLT_RSLT_SHIFT                    (3U)
/*! RSLT - Digital Result of the Conversion
 */
#define HSADC_RSLT_RSLT(x)                       (((uint16_t)(((uint16_t)(x)) << HSADC_RSLT_RSLT_SHIFT)) & HSADC_RSLT_RSLT_MASK)

#define HSADC_RSLT_SEXT_MASK                     (0x8000U)
#define HSADC_RSLT_SEXT_SHIFT                    (15U)
/*! SEXT - Sign Extend
 */
#define HSADC_RSLT_SEXT(x)                       (((uint16_t)(((uint16_t)(x)) << HSADC_RSLT_SEXT_SHIFT)) & HSADC_RSLT_SEXT_MASK)
/*! @} */

/* The count of HSADC_RSLT */
#define HSADC_RSLT_COUNT                         (16U)

/*! @name LOLIM - HSADC Low Limit Registers */
/*! @{ */

#define HSADC_LOLIM_LLMT_MASK                    (0x7FF8U)
#define HSADC_LOLIM_LLMT_SHIFT                   (3U)
/*! LLMT - Low Limit Bits
 */
#define HSADC_LOLIM_LLMT(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_LOLIM_LLMT_SHIFT)) & HSADC_LOLIM_LLMT_MASK)
/*! @} */

/* The count of HSADC_LOLIM */
#define HSADC_LOLIM_COUNT                        (16U)

/*! @name HILIM - HSADC High Limit Registers */
/*! @{ */

#define HSADC_HILIM_HLMT_MASK                    (0x7FF8U)
#define HSADC_HILIM_HLMT_SHIFT                   (3U)
/*! HLMT - High Limit Bits
 */
#define HSADC_HILIM_HLMT(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_HILIM_HLMT_SHIFT)) & HSADC_HILIM_HLMT_MASK)
/*! @} */

/* The count of HSADC_HILIM */
#define HSADC_HILIM_COUNT                        (16U)

/*! @name OFFST - HSADC Offset Register */
/*! @{ */

#define HSADC_OFFST_OFFSET_MASK                  (0x7FF8U)
#define HSADC_OFFST_OFFSET_SHIFT                 (3U)
/*! OFFSET - HSADC Offset Bits
 */
#define HSADC_OFFST_OFFSET(x)                    (((uint16_t)(((uint16_t)(x)) << HSADC_OFFST_OFFSET_SHIFT)) & HSADC_OFFST_OFFSET_MASK)
/*! @} */

/* The count of HSADC_OFFST */
#define HSADC_OFFST_COUNT                        (16U)

/*! @name PWR - HSADC Power Control Register */
/*! @{ */

#define HSADC_PWR_PDA_MASK                       (0x1U)
#define HSADC_PWR_PDA_SHIFT                      (0U)
/*! PDA - Manual Power Down for Converter A
 *  0b0..Power Up ADC converter A
 *  0b1..Power Down ADC converter A
 */
#define HSADC_PWR_PDA(x)                         (((uint16_t)(((uint16_t)(x)) << HSADC_PWR_PDA_SHIFT)) & HSADC_PWR_PDA_MASK)

#define HSADC_PWR_PDB_MASK                       (0x2U)
#define HSADC_PWR_PDB_SHIFT                      (1U)
/*! PDB - Manual Power Down for Converter B
 *  0b0..Power Up ADC converter B
 *  0b1..Power Down ADC converter B
 */
#define HSADC_PWR_PDB(x)                         (((uint16_t)(((uint16_t)(x)) << HSADC_PWR_PDB_SHIFT)) & HSADC_PWR_PDB_MASK)

#define HSADC_PWR_APD_MASK                       (0x8U)
#define HSADC_PWR_APD_SHIFT                      (3U)
/*! APD - Auto Powerdown
 *  0b0..Auto Powerdown Mode is not active
 *  0b1..Auto Powerdown Mode is active
 */
#define HSADC_PWR_APD(x)                         (((uint16_t)(((uint16_t)(x)) << HSADC_PWR_APD_SHIFT)) & HSADC_PWR_APD_MASK)

#define HSADC_PWR_PUDELAY_MASK                   (0x3F0U)
#define HSADC_PWR_PUDELAY_SHIFT                  (4U)
/*! PUDELAY - Power Up Delay
 */
#define HSADC_PWR_PUDELAY(x)                     (((uint16_t)(((uint16_t)(x)) << HSADC_PWR_PUDELAY_SHIFT)) & HSADC_PWR_PUDELAY_MASK)

#define HSADC_PWR_PSTSA_MASK                     (0x400U)
#define HSADC_PWR_PSTSA_SHIFT                    (10U)
/*! PSTSA - ADC Converter A Power Status
 *  0b0..ADC Converter A is currently powered up
 *  0b1..ADC Converter A is currently powered down
 */
#define HSADC_PWR_PSTSA(x)                       (((uint16_t)(((uint16_t)(x)) << HSADC_PWR_PSTSA_SHIFT)) & HSADC_PWR_PSTSA_MASK)

#define HSADC_PWR_PSTSB_MASK                     (0x800U)
#define HSADC_PWR_PSTSB_SHIFT                    (11U)
/*! PSTSB - ADC Converter B Power Status
 *  0b0..ADC Converter B is currently powered up
 *  0b1..ADC Converter B is currently powered down
 */
#define HSADC_PWR_PSTSB(x)                       (((uint16_t)(((uint16_t)(x)) << HSADC_PWR_PSTSB_SHIFT)) & HSADC_PWR_PSTSB_MASK)

#define HSADC_PWR_ASB_MASK                       (0x8000U)
#define HSADC_PWR_ASB_SHIFT                      (15U)
/*! ASB - Auto Standby
 *  0b0..Auto standby mode disabled
 *  0b1..Auto standby mode enabled
 */
#define HSADC_PWR_ASB(x)                         (((uint16_t)(((uint16_t)(x)) << HSADC_PWR_ASB_SHIFT)) & HSADC_PWR_ASB_MASK)
/*! @} */

/*! @name SCTRL - HSADC Scan Control Register */
/*! @{ */

