nxp-mcuxpresso/mcux-sdk/devices/MKV56F24/MKV56F24.h
#define HSADC_SCTRL_SC_MASK                      (0xFFFFU)
#define HSADC_SCTRL_SC_SHIFT                     (0U)
/*! SC - Scan Control Bits
 *  0b0000000000000000..Perform sample immediately after the completion of the current sample.
 *  0b0000000000000001..Delay sample until a new sync input occurs.
 */
#define HSADC_SCTRL_SC(x)                        (((uint16_t)(((uint16_t)(x)) << HSADC_SCTRL_SC_SHIFT)) & HSADC_SCTRL_SC_MASK)
/*! @} */

/*! @name PWR2 - HSADC Power Control Register 2 */
/*! @{ */

#define HSADC_PWR2_DIVB_MASK                     (0x3F00U)
#define HSADC_PWR2_DIVB_SHIFT                    (8U)
/*! DIVB - Clock Divisor Select
 */
#define HSADC_PWR2_DIVB(x)                       (((uint16_t)(((uint16_t)(x)) << HSADC_PWR2_DIVB_SHIFT)) & HSADC_PWR2_DIVB_MASK)
/*! @} */

/*! @name CTRL3 - HSADC Control Register 3 */
/*! @{ */

#define HSADC_CTRL3_DMASRC_MASK                  (0x40U)
#define HSADC_CTRL3_DMASRC_SHIFT                 (6U)
/*! DMASRC - DMA Trigger Source
 *  0b0..DMA trigger source is end of scan interrupt
 *  0b1..DMA trigger source is RDY bits
 */
#define HSADC_CTRL3_DMASRC(x)                    (((uint16_t)(((uint16_t)(x)) << HSADC_CTRL3_DMASRC_SHIFT)) & HSADC_CTRL3_DMASRC_MASK)

#define HSADC_CTRL3_ADCRES_MASK                  (0x300U)
#define HSADC_CTRL3_ADCRES_SHIFT                 (8U)
/*! ADCRES - ADCA/B Conversion Resolution
 *  0b00..6-bit mode
 *  0b01..8-bit mode
 *  0b10..10-bit mode
 *  0b11..12-bit mode
 */
#define HSADC_CTRL3_ADCRES(x)                    (((uint16_t)(((uint16_t)(x)) << HSADC_CTRL3_ADCRES_SHIFT)) & HSADC_CTRL3_ADCRES_MASK)
/*! @} */

/*! @name SCINTEN - HSADC Scan Interrupt Enable Register */
/*! @{ */

#define HSADC_SCINTEN_SCINTEN_MASK               (0xFFFFU)
#define HSADC_SCINTEN_SCINTEN_SHIFT              (0U)
/*! SCINTEN - Scan Interrupt Enable
 *  0b0000000000000000..Scan interrupt is not enabled for this sample.
 *  0b0000000000000001..Scan interrupt is enabled for this sample.
 */
#define HSADC_SCINTEN_SCINTEN(x)                 (((uint16_t)(((uint16_t)(x)) << HSADC_SCINTEN_SCINTEN_SHIFT)) & HSADC_SCINTEN_SCINTEN_MASK)
/*! @} */

/*! @name SAMPTIM - HSADC Sampling Time Configuration Register */
/*! @{ */

#define HSADC_SAMPTIM_SAMPT_A_MASK               (0xFFU)
#define HSADC_SAMPTIM_SAMPT_A_SHIFT              (0U)
/*! SAMPT_A - Sampling Time for ADCA.
 */
#define HSADC_SAMPTIM_SAMPT_A(x)                 (((uint16_t)(((uint16_t)(x)) << HSADC_SAMPTIM_SAMPT_A_SHIFT)) & HSADC_SAMPTIM_SAMPT_A_MASK)

#define HSADC_SAMPTIM_SAMPT_B_MASK               (0xFF00U)
#define HSADC_SAMPTIM_SAMPT_B_SHIFT              (8U)
/*! SAMPT_B - Sampling Time for ADCB.
 */
#define HSADC_SAMPTIM_SAMPT_B(x)                 (((uint16_t)(((uint16_t)(x)) << HSADC_SAMPTIM_SAMPT_B_SHIFT)) & HSADC_SAMPTIM_SAMPT_B_MASK)
/*! @} */

/*! @name CALIB - HSADCs Calibration Configuration */
/*! @{ */

#define HSADC_CALIB_REQSINGA_MASK                (0x1U)
#define HSADC_CALIB_REQSINGA_SHIFT               (0U)
/*! REQSINGA - ADCA Calibration request for single ended mode
 *  0b0..Calibration value calculation is not requested to be run on ADCA.
 *  0b1..Calibration value calculation for single-ended input mode is requested to be run on ADCA.
 */
#define HSADC_CALIB_REQSINGA(x)                  (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_REQSINGA_SHIFT)) & HSADC_CALIB_REQSINGA_MASK)

#define HSADC_CALIB_REQDIFA_MASK                 (0x2U)
#define HSADC_CALIB_REQDIFA_SHIFT                (1U)
/*! REQDIFA - ADCA Calibration request for differential mode
 *  0b0..Calibration value calculation is not requested to ADCA.
 *  0b1..Calibration value calculation for differential input mode is requested to be run on ADCA.
 */
#define HSADC_CALIB_REQDIFA(x)                   (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_REQDIFA_SHIFT)) & HSADC_CALIB_REQDIFA_MASK)

#define HSADC_CALIB_BYPA_MASK                    (0x4U)
#define HSADC_CALIB_BYPA_SHIFT                   (2U)
/*! BYPA - ADCA calibration bypass
 *  0b0..ADCA block uses the calibration values to obtain the final conversion result (differential or single-ended mode)
 *  0b1..Calibration operation is bypassed on ADCA.
 */
#define HSADC_CALIB_BYPA(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_BYPA_SHIFT)) & HSADC_CALIB_BYPA_MASK)

#define HSADC_CALIB_CAL_REQA_MASK                (0x8U)
#define HSADC_CALIB_CAL_REQA_SHIFT               (3U)
/*! CAL_REQA - Calibration Request for ADCA
 *  0b0..None.
 *  0b1..Calibration request for ADCA.
 */
#define HSADC_CALIB_CAL_REQA(x)                  (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_CAL_REQA_SHIFT)) & HSADC_CALIB_CAL_REQA_MASK)

#define HSADC_CALIB_REQSINGB_MASK                (0x10U)
#define HSADC_CALIB_REQSINGB_SHIFT               (4U)
/*! REQSINGB - ADCB Calibration request for single ended mode
 *  0b0..Calibration value calculation is not requested to be run on ADCB.
 *  0b1..Calibration value calculation for single-ended input mode is requested to be run on ADCB.
 */
#define HSADC_CALIB_REQSINGB(x)                  (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_REQSINGB_SHIFT)) & HSADC_CALIB_REQSINGB_MASK)

#define HSADC_CALIB_REQDIFB_MASK                 (0x20U)
#define HSADC_CALIB_REQDIFB_SHIFT                (5U)
/*! REQDIFB - ADCB Calibration request for differential mode
 *  0b0..Calibration value calculation is not requested to be run on ADCB.
 *  0b1..Calibration value calculation for differential input mode is requested to be run onr ADCB
 */
#define HSADC_CALIB_REQDIFB(x)                   (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_REQDIFB_SHIFT)) & HSADC_CALIB_REQDIFB_MASK)

#define HSADC_CALIB_BYPB_MASK                    (0x40U)
#define HSADC_CALIB_BYPB_SHIFT                   (6U)
/*! BYPB - ADCB calibration bypass
 *  0b0..ADCB block uses the calibration values to obtain the final conversion result (differential or single-ended mode)
 *  0b1..Calibration operation is bypassed on ADCB.
 */
#define HSADC_CALIB_BYPB(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_BYPB_SHIFT)) & HSADC_CALIB_BYPB_MASK)

