nxp-mcuxpresso/mcux-sdk/devices/MKV56F24/MKV56F24.h
#define XBARB_SEL5_SEL10_MASK                    (0x3FU)
#define XBARB_SEL5_SEL10_SHIFT                   (0U)
/*! SEL10
 *  0b000000..CMP0 Output
 *  0b000001..CMP1 Output
 *  0b000010..CMP2 Output
 *  0b000011..CMP3 Output
 *  0b000100..FTM0 all channels match trigger ORed together
 *  0b000101..FTM0 counter init trigger
 *  0b000110..FTM3 all channels match trigger ORed together
 *  0b000111..FTM3 counter init trigger
 *  0b001000..PWMA channel 0 trigger 0
 *  0b001001..PWMA channel 1 trigger 0
 *  0b001010..PWMA channel 2 trigger 0
 *  0b001011..PWMA channel 3 trigger 0
 *  0b001100..PDB0 channel 0 output trigger
 *  0b001101..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b001110..XB_IN2 input pin
 *  0b001111..XB_IN3 input pin
 *  0b010000..FTM1 all channels match trigger ORed together
 *  0b010001..FTM1 counter init trigger
 *  0b010010..DMA channel 0 done
 *  0b010011..DMA channel 1 done
 *  0b010100..XB_IN10 input pin
 *  0b010101..XB_IN11 input pin
 *  0b010110..DMA channel 6 done
 *  0b010111..DMA channel 7 done
 *  0b011000..PIT trigger 0
 *  0b011001..PIT trigger 1
 *  0b011010..PDB1 channel 0 output trigger
 *  0b011011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b011100..PWMB channel 0 trigger 0 or trigger 1
 *  0b011101..PWMB channel 1 trigger 0 or trigger 1
 *  0b011110..PWMB channel 2 trigger 0 or trigger 1
 *  0b011111..PWMB channel 3 trigger 0 or trigger 1
 *  0b100000..FTM2 all channels match trigger ORed together
 *  0b100001..FTM2 counter init trigger
 *  0b100010..PDB0 channel 1 output trigger
 *  0b100011..PDB1 channel 1 output trigger
 *  0b100100..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100101..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100110..Analog-to-Digital Converter 0 conversion complete
 */
#define XBARB_SEL5_SEL10(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL5_SEL10_SHIFT)) & XBARB_SEL5_SEL10_MASK)

#define XBARB_SEL5_SEL11_MASK                    (0x3F00U)
#define XBARB_SEL5_SEL11_SHIFT                   (8U)
/*! SEL11
 *  0b000000..CMP0 Output
 *  0b000001..CMP1 Output
 *  0b000010..CMP2 Output
 *  0b000011..CMP3 Output
 *  0b000100..FTM0 all channels match trigger ORed together
 *  0b000101..FTM0 counter init trigger
 *  0b000110..FTM3 all channels match trigger ORed together
 *  0b000111..FTM3 counter init trigger
 *  0b001000..PWMA channel 0 trigger 0
 *  0b001001..PWMA channel 1 trigger 0
 *  0b001010..PWMA channel 2 trigger 0
 *  0b001011..PWMA channel 3 trigger 0
 *  0b001100..PDB0 channel 0 output trigger
 *  0b001101..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b001110..XB_IN2 input pin
 *  0b001111..XB_IN3 input pin
 *  0b010000..FTM1 all channels match trigger ORed together
 *  0b010001..FTM1 counter init trigger
 *  0b010010..DMA channel 0 done
 *  0b010011..DMA channel 1 done
 *  0b010100..XB_IN10 input pin
 *  0b010101..XB_IN11 input pin
 *  0b010110..DMA channel 6 done
 *  0b010111..DMA channel 7 done
 *  0b011000..PIT trigger 0
 *  0b011001..PIT trigger 1
 *  0b011010..PDB1 channel 0 output trigger
 *  0b011011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b011100..PWMB channel 0 trigger 0 or trigger 1
 *  0b011101..PWMB channel 1 trigger 0 or trigger 1
 *  0b011110..PWMB channel 2 trigger 0 or trigger 1
 *  0b011111..PWMB channel 3 trigger 0 or trigger 1
 *  0b100000..FTM2 all channels match trigger ORed together
 *  0b100001..FTM2 counter init trigger
 *  0b100010..PDB0 channel 1 output trigger
 *  0b100011..PDB1 channel 1 output trigger
 *  0b100100..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100101..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100110..Analog-to-Digital Converter 0 conversion complete
 */
#define XBARB_SEL5_SEL11(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL5_SEL11_SHIFT)) & XBARB_SEL5_SEL11_MASK)
/*! @} */

/*! @name SEL6 - Crossbar B Select Register 6 */
/*! @{ */

#define XBARB_SEL6_SEL12_MASK                    (0x3FU)
#define XBARB_SEL6_SEL12_SHIFT                   (0U)
/*! SEL12
 *  0b000000..CMP0 Output
 *  0b000001..CMP1 Output
 *  0b000010..CMP2 Output
 *  0b000011..CMP3 Output
 *  0b000100..FTM0 all channels match trigger ORed together
 *  0b000101..FTM0 counter init trigger
 *  0b000110..FTM3 all channels match trigger ORed together
 *  0b000111..FTM3 counter init trigger
 *  0b001000..PWMA channel 0 trigger 0
 *  0b001001..PWMA channel 1 trigger 0
 *  0b001010..PWMA channel 2 trigger 0
 *  0b001011..PWMA channel 3 trigger 0
 *  0b001100..PDB0 channel 0 output trigger
 *  0b001101..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b001110..XB_IN2 input pin
 *  0b001111..XB_IN3 input pin
 *  0b010000..FTM1 all channels match trigger ORed together
 *  0b010001..FTM1 counter init trigger
 *  0b010010..DMA channel 0 done
 *  0b010011..DMA channel 1 done
 *  0b010100..XB_IN10 input pin
 *  0b010101..XB_IN11 input pin
 *  0b010110..DMA channel 6 done
 *  0b010111..DMA channel 7 done
 *  0b011000..PIT trigger 0
 *  0b011001..PIT trigger 1
 *  0b011010..PDB1 channel 0 output trigger
 *  0b011011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b011100..PWMB channel 0 trigger 0 or trigger 1
 *  0b011101..PWMB channel 1 trigger 0 or trigger 1
 *  0b011110..PWMB channel 2 trigger 0 or trigger 1
 *  0b011111..PWMB channel 3 trigger 0 or trigger 1
 *  0b100000..FTM2 all channels match trigger ORed together
 *  0b100001..FTM2 counter init trigger
 *  0b100010..PDB0 channel 1 output trigger
 *  0b100011..PDB1 channel 1 output trigger
 *  0b100100..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100101..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100110..Analog-to-Digital Converter 0 conversion complete
 */
#define XBARB_SEL6_SEL12(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL6_SEL12_SHIFT)) & XBARB_SEL6_SEL12_MASK)

